let year = +prompt('Введіть рік вашого народження');
let mess = '';

if (!year) {
    alert("Шкода, що ви не захотіли ввести свій рік народження.");

} else{
    mess = `Вам ${2023 - year} років.\n`;

}

let city = prompt('В якому місті ви проживаєте?');

if (!city) {
    alert("Шкода, що ви не захотіли ввести своє місто.");

} else{
    switch (city) {
        case "Київ":
            mess += `Ти живеш у столиці України\n`;
            break;
        case "Лондон":
            mess += `Ти живеш у столиці Великобританії\n`;
            break;
        case "Вашингтон":
            mess += `Ти живеш у столиці США\n`;
            break;
        default:
            mess += `Ти живеш у місті ${city}\n`;
            break;  
    }
}

let sport = prompt('Ваш улюблений вид спорту?');

if (!sport) {
    alert("Шкода, що ви не захотіли ввести свій улюблений вид спорту.");

} else{
    switch (sport) {
        case "Бокс":
            mess += `Круто! Хочеш стати чемпіоном як Олександр Усик?\n`;
            break;
        case "Футбол":
            mess += `Круто! Хочеш стати чемпіоном як Кріштіану Роналду?\n`;
            break;
        case "Теніс":
            mess += `Круто! Хочеш стати чемпіоном як Іван Май?\n`;
            break;
        default:
            mess += `Твій улюблений вид спорту ${sport}\n`;
            break;  
    }
}

alert(mess);